## _30 Days Python Bootcamp @ BEST-ENLIST_

### _Author: SANDHYA S_

### _Date: 02 July '21_

## _Task: MySql - JOIN_
---

- You can combine rows from two or more tables, based on a related column between them, by using a JOIN statement.
```
sql = "SELECT users.name AS user, products.name AS favorite FROM users\
        INNER JOIN products ON users.fav = products.id"
mycursor.execute(sql)
myresult = mycursor.fetchall()
```

- If you want to show all users, even if they do not have a favourite product, use the LEFT JOIN statement.
```
sql = "SELECT users.name AS user, products.name AS favorite FROM users\
        LEFT JOIN products ON users.fav = products.id"
```

- If you want to return all products, and the users who have them as their favorite, even if no user have them as their favorite, use the RIGHT JOIN statement.
```
sql = "SELECT users.name AS user, products.name AS favorite FROM users\
        RIGHT JOIN products ON users.fav = products.id"
```

- You can limit the number of records returned from the query, by using the LIMIT statement
```
mycursor.execute("SELECT * FROM customers LIMIT 5")
myresult = mycursor.fetchall()
```
---

# Exercise

## 1. Create an employee Table with employee name, employee ID & Salary
> ### a.	Write a query to get the maximum and minimum salary from employees table
> ### b.	Write a query to get the number of employees working with the company
> ### c.	Write a query to get the first 3 characters of first name from employees table

In [1]:
import mysql.connector as msq
db = msq.connect(host='localhost', user='root', password='password', database='mydb')
cur = db.cursor(buffered=True)

# Creating table, 'Employee' 
tab = 'CREATE TABLE employee(EmpId VARCHAR(7), EmpName VARCHAR(25), EmpSal INTEGER(7))'
cur.execute(tab)

# Inserting values into the table
query = 'INSERT INTO Employee(EmpId, EmpName, EmpSal) VALUES(%s, %s, %s)'
data = [('E1001', 'Luke', 24000), ('E1002', 'Marnie', 30000), ('E1003', 'Anne', 43000), ('E1004', 'Lucy', 32000), 
        ('E1005', 'Chelsea', 25000), ('E1006', 'Kelly', 29000), ('E1007', 'Todd', 31000), ('E1008', 'Kirk', 18000), 
        ('E1009', 'Suzanne', 21000), ('E1010', 'Tina', 15000), ('E1011', 'Alan', 17000), ('E1012', 'Jie', 45000),
        ('E1013', 'Ruth', 37000), ('E1014', 'Peyton', 18000), ('E1015', 'Shawna', 23000), ('E1016', 'Ziba', 35000),
        ('E1017', 'Chris', 19000), ('E1018', 'Melissa', 32000), ('E1019', 'Shelly', 18000), ('E1020', 'Alex', 34000)]
cur.executemany(query, data)
db.commit()

In [2]:
# Displaying entries of the table
query = 'SELECT * FROM employee'
cur.execute(query)
emp = cur.fetchall()
print('EMPLOYEE DETAILS:')
print(f'Id\tName\tSalary\n{"-"*22}')
for i in range(len(emp)):
    print(f'{emp[i][0]}\t{emp[i][1]}\t{emp[i][2]}')

EMPLOYEE DETAILS:
Id	Name	Salary
----------------------
E1001	Luke	24000
E1002	Marnie	30000
E1003	Anne	43000
E1004	Lucy	32000
E1005	Chelsea	25000
E1006	Kelly	29000
E1007	Todd	31000
E1008	Kirk	18000
E1009	Suzanne	21000
E1010	Tina	15000
E1011	Alan	17000
E1012	Jie	45000
E1013	Ruth	37000
E1014	Peyton	18000
E1015	Shawna	23000
E1016	Ziba	35000
E1017	Chris	19000
E1018	Melissa	32000
E1019	Shelly	18000
E1020	Alex	34000

### _a) Maximum and Minimum salary from employees table_

In [3]:
query = 'SELECT * FROM employee WHERE EmpSal = (SELECT MIN(EmpSal) FROM employee) OR\
                                      EmpSal = (SELECT MAX(EmpSal) FROM employee)'
cur.execute(query)
sal = cur.fetchall()
print('Employees with Minimum & Maximum Salary:\n')
print(f'Id\tName\tSalary\n{"-"*22}')
for i in range(2):
    print(f'{sal[i][0]}\t{sal[i][1]}\t{sal[i][2]}')

Employees with Minimum & Maximum Salary:

Id	Name	Salary
----------------------
E1010	Tina	15000
E1012	Jie	45000

### _b) Number of employees working with the company_

In [4]:
query = 'SELECT COUNT(*) FROM employee'
cur.execute(query)
total = cur.fetchall()
print(f'Total Number of Employees: {total[0][0]}')

Total Number of Employees: 20

### _c) First 3 characters of first name from employees table_

In [5]:
query = 'SELECT SUBSTRING(EmpName, 1, 3) FROM employee'
cur.execute(query)
three = cur.fetchall()
print(f'Name(3 Char):\n{"-"*12}')
for i in range(len(three)):
    print(three[i][0])

Name(3 Char):
------------
Luk
Mar
Ann
Luc
Che
Kel
Tod
Kir
Suz
Tin
Ala
Jie
Rut
Pey
Sha
Zib
Chr
Mel
She
Ale

In [6]:
cur.execute('DROP TABLE employee')
cur.close()
db.close()

## _Thank You!_
---